zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/periph5/PERI_RFMC.h
#define RFMC_RF2P4GHZ_MAN2_MAN_EN_MASK           (0x80000000U)
#define RFMC_RF2P4GHZ_MAN2_MAN_EN_SHIFT          (31U)
/*! MAN_EN - MAN Enable
 *  0b0..MAN low power mode entry/wakeup disabled
 *  0b1..MAN low power mode entry/wakeup enabled
 */
#define RFMC_RF2P4GHZ_MAN2_MAN_EN(x)             (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_MAN2_MAN_EN_SHIFT)) & RFMC_RF2P4GHZ_MAN2_MAN_EN_MASK)
/*! @} */

/*! @name RF2P4GHZ_MAN3 - 2.4GHz MAN Register 3 */
/*! @{ */

#define RFMC_RF2P4GHZ_MAN3_ENTER_TIME_CAPT_MASK  (0xFFFFFFU)
#define RFMC_RF2P4GHZ_MAN3_ENTER_TIME_CAPT_SHIFT (0U)
/*! ENTER_TIME_CAPT - MAN Low Power Entry Time Captured */
#define RFMC_RF2P4GHZ_MAN3_ENTER_TIME_CAPT(x)    (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_MAN3_ENTER_TIME_CAPT_SHIFT)) & RFMC_RF2P4GHZ_MAN3_ENTER_TIME_CAPT_MASK)
/*! @} */

/*! @name RF2P4GHZ_MAN4 - 2.4GHz MAN Register 4 */
/*! @{ */

#define RFMC_RF2P4GHZ_MAN4_WKUP_TIME_CAPT_MASK   (0xFFFFFFU)
#define RFMC_RF2P4GHZ_MAN4_WKUP_TIME_CAPT_SHIFT  (0U)
/*! WKUP_TIME_CAPT - MAN Low Power Wakeup Time Captured */
#define RFMC_RF2P4GHZ_MAN4_WKUP_TIME_CAPT(x)     (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_MAN4_WKUP_TIME_CAPT_SHIFT)) & RFMC_RF2P4GHZ_MAN4_WKUP_TIME_CAPT_MASK)
/*! @} */

/*! @name RF2P4GHZ_HOST2RADIO - RF 2.4GHz Buffer from Host to Radio */
/*! @{ */

#define RFMC_RF2P4GHZ_HOST2RADIO_DATA_MASK       (0xFFFFU)
#define RFMC_RF2P4GHZ_HOST2RADIO_DATA_SHIFT      (0U)
/*! DATA - Data of Buffer0 */
#define RFMC_RF2P4GHZ_HOST2RADIO_DATA(x)         (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_HOST2RADIO_DATA_SHIFT)) & RFMC_RF2P4GHZ_HOST2RADIO_DATA_MASK)
/*! @} */

/*! @name RF2P4GHZ_RADIO2HOST - RF 2.4GHz Buffer from Radio to Host */
/*! @{ */

#define RFMC_RF2P4GHZ_RADIO2HOST_DATA_MASK       (0xFFFFU)
#define RFMC_RF2P4GHZ_RADIO2HOST_DATA_SHIFT      (0U)
/*! DATA - Data of Buffer0 */
#define RFMC_RF2P4GHZ_RADIO2HOST_DATA(x)         (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_RADIO2HOST_DATA_SHIFT)) & RFMC_RF2P4GHZ_RADIO2HOST_DATA_MASK)
/*! @} */

/*! @name RF2P4GHZ_CFG - 2.4GHz Radio Configuration Register */
/*! @{ */

#define RFMC_RF2P4GHZ_CFG_BLE_FAST_WKUP_MASK     (0x1U)
#define RFMC_RF2P4GHZ_CFG_BLE_FAST_WKUP_SHIFT    (0U)
/*! BLE_FAST_WKUP - No LP Wakeup Delay on WakeUp from Host */
#define RFMC_RF2P4GHZ_CFG_BLE_FAST_WKUP(x)       (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_CFG_BLE_FAST_WKUP_SHIFT)) & RFMC_RF2P4GHZ_CFG_BLE_FAST_WKUP_MASK)

#define RFMC_RF2P4GHZ_CFG_RFMC_RADIO_DEBUG_REQ_EN_MASK (0x2U)
#define RFMC_RF2P4GHZ_CFG_RFMC_RADIO_DEBUG_REQ_EN_SHIFT (1U)
/*! RFMC_RADIO_DEBUG_REQ_EN - rfmc_radio_debug_req_en */
#define RFMC_RF2P4GHZ_CFG_RFMC_RADIO_DEBUG_REQ_EN(x) (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_CFG_RFMC_RADIO_DEBUG_REQ_EN_SHIFT)) & RFMC_RF2P4GHZ_CFG_RFMC_RADIO_DEBUG_REQ_EN_MASK)

#define RFMC_RF2P4GHZ_CFG_RFMC_EXT_WAKEUP_EN_MASK (0xCU)
#define RFMC_RF2P4GHZ_CFG_RFMC_EXT_WAKEUP_EN_SHIFT (2U)
/*! RFMC_EXT_WAKEUP_EN - Enable Radio wakeup by external source */
#define RFMC_RF2P4GHZ_CFG_RFMC_EXT_WAKEUP_EN(x)  (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_CFG_RFMC_EXT_WAKEUP_EN_SHIFT)) & RFMC_RF2P4GHZ_CFG_RFMC_EXT_WAKEUP_EN_MASK)

#define RFMC_RF2P4GHZ_CFG_FORCE_DBG_PWRUP_ACK_MASK (0x10U)
#define RFMC_RF2P4GHZ_CFG_FORCE_DBG_PWRUP_ACK_SHIFT (4U)
/*! FORCE_DBG_PWRUP_ACK - Controls the Radio ack so that Radio can go into power down in debug mode also */
#define RFMC_RF2P4GHZ_CFG_FORCE_DBG_PWRUP_ACK(x) (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_CFG_FORCE_DBG_PWRUP_ACK_SHIFT)) & RFMC_RF2P4GHZ_CFG_FORCE_DBG_PWRUP_ACK_MASK)
/*! @} */

/*! @name RF2P4GHZ_WKUP_SRC - 2.4GHz Radio WakeUp Source Register */
/*! @{ */

#define RFMC_RF2P4GHZ_WKUP_SRC_RFMC_RADIO_DEBUG_REQ_STATUS_MASK (0x1U)
#define RFMC_RF2P4GHZ_WKUP_SRC_RFMC_RADIO_DEBUG_REQ_STATUS_SHIFT (0U)
/*! RFMC_RADIO_DEBUG_REQ_STATUS - Radio debug request status */
#define RFMC_RF2P4GHZ_WKUP_SRC_RFMC_RADIO_DEBUG_REQ_STATUS(x) (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_WKUP_SRC_RFMC_RADIO_DEBUG_REQ_STATUS_SHIFT)) & RFMC_RF2P4GHZ_WKUP_SRC_RFMC_RADIO_DEBUG_REQ_STATUS_MASK)

#define RFMC_RF2P4GHZ_WKUP_SRC_RFMC_EXT_WAKEUP_STATUS_MASK (0x6U)
#define RFMC_RF2P4GHZ_WKUP_SRC_RFMC_EXT_WAKEUP_STATUS_SHIFT (1U)
/*! RFMC_EXT_WAKEUP_STATUS - Radio wakeup by external source status */
#define RFMC_RF2P4GHZ_WKUP_SRC_RFMC_EXT_WAKEUP_STATUS(x) (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_WKUP_SRC_RFMC_EXT_WAKEUP_STATUS_SHIFT)) & RFMC_RF2P4GHZ_WKUP_SRC_RFMC_EXT_WAKEUP_STATUS_MASK)

#define RFMC_RF2P4GHZ_WKUP_SRC_BLE_WKUP_STATUS_MASK (0x8U)
#define RFMC_RF2P4GHZ_WKUP_SRC_BLE_WKUP_STATUS_SHIFT (3U)
/*! BLE_WKUP_STATUS - RFMC BLE Wakeup status (Host Controlled) */
#define RFMC_RF2P4GHZ_WKUP_SRC_BLE_WKUP_STATUS(x) (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_WKUP_SRC_BLE_WKUP_STATUS_SHIFT)) & RFMC_RF2P4GHZ_WKUP_SRC_BLE_WKUP_STATUS_MASK)

#define RFMC_RF2P4GHZ_WKUP_SRC_MAN_WKUP_STATUS_MASK (0x10U)
#define RFMC_RF2P4GHZ_WKUP_SRC_MAN_WKUP_STATUS_SHIFT (4U)
/*! MAN_WKUP_STATUS - RFMC MAN Wakeup status (Host Controlled) */
#define RFMC_RF2P4GHZ_WKUP_SRC_MAN_WKUP_STATUS(x) (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_WKUP_SRC_MAN_WKUP_STATUS_SHIFT)) & RFMC_RF2P4GHZ_WKUP_SRC_MAN_WKUP_STATUS_MASK)

#define RFMC_RF2P4GHZ_WKUP_SRC_WOR_WKUP_STATUS_MASK (0x20U)
#define RFMC_RF2P4GHZ_WKUP_SRC_WOR_WKUP_STATUS_SHIFT (5U)
/*! WOR_WKUP_STATUS - RFMC WOR Wakeup status (Host Controlled) */
#define RFMC_RF2P4GHZ_WKUP_SRC_WOR_WKUP_STATUS(x) (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_WKUP_SRC_WOR_WKUP_STATUS_SHIFT)) & RFMC_RF2P4GHZ_WKUP_SRC_WOR_WKUP_STATUS_MASK)

#define RFMC_RF2P4GHZ_WKUP_SRC_RF_CMC_BLE_WKUP_STATUS_MASK (0x40U)
#define RFMC_RF2P4GHZ_WKUP_SRC_RF_CMC_BLE_WKUP_STATUS_SHIFT (6U)
/*! RF_CMC_BLE_WKUP_STATUS - RF_CMC BLE Wakeup status */
#define RFMC_RF2P4GHZ_WKUP_SRC_RF_CMC_BLE_WKUP_STATUS(x) (((uint32_t)(((uint32_t)(x)) << RFMC_RF2P4GHZ_WKUP_SRC_RF_CMC_BLE_WKUP_STATUS_SHIFT)) & RFMC_RF2P4GHZ_WKUP_SRC_RF_CMC_BLE_WKUP_STATUS_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group RFMC_Register_Masks */


/*!
 * @}
 */ /* end of group RFMC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_RFMC_H_ */

